sdaiDeleteADB(Sdai_ADBId*)
\details
Deletes a specified Attribute Data Block (ADB) instance.
\param block [in] An ADB instance to be deleted.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiAB_NEXS - ADB does not exist.
* sdaiSY_ERR - Underlying system error.
\code
SdaiADB block = sdaiCreateEmptyADB();
...
sdaiDeleteADB(block);